import random
answers = ['Бесспорно', 'Мне кажется - да', 'Пока неясно, попробуй снова', 'Даже не думай', 'Предрешено', 'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет', 'Никаких сомнений', 'Хорошие перспективы', 'Лучше не рассказывать', 'По моим данным - нет', 'Определённо да'    'Знаки говорят - да'    'Сейчас нельзя предсказать' 'Перспективы не очень хорошие', 'Можешь быть уверен в этом', 'Да', 'Сконцентрируйся и спроси опять', 'Весьма сомнительно']
def welcome():
    print('Привет, Мир! Я магический шр и я знаю ответ на любой твой вопрос!')
    name=input('Как тебя зовут? Меня зовут: ')
    print(f'Привет, {name}')
def question():
    welcome()
    while True:
        input('Задай свой вопрос!\n')
        print(random.choice(answers))
        s=input('Хочешь задать ещё вопрос? Y/N: ')
        if s.lower()!='y':
            print('Возвращайся, если возникнут вопросы!')
            break
question()