"""Напишите функцию print_symbol_counts(s), которая принимает на вход слово s и выводит для каждой буквы этого слова в лексикографическом порядке в нижнем регистре на отдельной строке количество её вхождений в это слово в следующем формате:
<L>: <N> где <L> – некоторая буква слова s, <N> – количество вхождений этой буквы в слово s.
Примечание. Обратите внимание: если в слове встречается одна и та же буква в разных регистрах, то мы считаем это одной и той же буквой (см. тест №4).
"""


# объявление функции
def print_symbol_counts(s):
    s=s.lower()
    letters=[s[i] for i in range(len(s)) if i==s.index(s[i])]
    letters.sort()
    for i in range(len(letters)):
        print(f'{letters[i]}: {s.count(letters[i])}')
    
# считываем данные
s = input()
# вызываем функцию
print_symbol_counts(s)